places = {
    "main": "Главное здание",
    "chem": "Химический корпус",
    "mech": "Механический корпус",
    "hydro_1": "Гидрокорпус №1",
    "hydro_2": "Гидрокорпус №2",
    "nik": "НИК",
    "stud_1": "1-й учебный корпус",
    "stud_2": "2-й учебный корпус",
    "stud_3": "3-й учебный корпус",
    "stud_4": "4-й учебный корпус",
    "stud_5": "5-й учебный корпус",
    "stud_6": "6-й учебный корпус",
    "stud_9": "9-й учебный корпус",
    "stud_10": "10-й учебный корпус",
    "stud_11": "11-й учебный корпус",
    "stud_15": "15-й учебный корпус",
    "stud_16": "16-й учебный корпус",
    "sport": "Спорткомплекс",
    "lab": "Лабораторный корпус",
    "hydro_3": "Гидробашня",
    "ran": "НОЦ РАН",
    "prof_1": "1-й проф. институт",
    "prof_2": "2-й проф. институт",
    "teach_house": "Дом учёных",
    "abit": "Приёмная комиссия",
    "ipm": "ИПМЭиТ",
}

location = {
    1: [60.007176, 30.372810],
    2: [60.006894, 30.376630],
    3: [60.008396, 30.377852],
    4: [60.00569, 30.38179],
    5: [60.00668, 30.38373],
    6: [60.006273, 30.379298],
    7: [60.00881, 30.37287],
    8: [60.00849, 30.37476],
    9: [60.007317, 30.381697],
    10: [60.00729, 30.37682],
    11: [59.999656, 30.374690],
    12: [60.000119, 30.367539],
    13: [60.000906, 30.366614],
    14: [60.000591, 30.369632],
    15: [60.009058, 30.377870],
    16: [60.00737, 30.39036],
    17: [60.008000, 30.389830],
    18: [60.002860, 30.368520],
    19: [60.007540, 30.380200],
    20: [60.005580, 30.374060],
    21: [60.002972, 30.373925],
    22: [60.004970, 30.369980],
    23: [60.004690, 30.378300],
    24: [60.004340, 30.380040],
    25: [60.009456, 30.371677],
    26: [59.994940, 30.357960],
}

nums = "0123456789"
symbols = "!?.,$&^*#@;-=+"
#-----------------------------------------------------------------------------------------

#ПУТИ
dbName = "db.db"
mainSource = "C:\\Users\\test\\Desktop\\polytech_bot\\polytech_bot\\"
#mainSource = "/home/lrrrtm1/"

#-----------------------------------------------------------------------------------------

#АДМИНКИ
adminList = [409801981, ]
mainAdminID = 409801981

#-----------------------------------------------------------------------------------------

#КОНСТАНТЫ
scheduleLink = "https://ruz.spbstu.ru/faculty/{0}/groups/{1}"
otherScheduleLink = "https://ruz.spbstu.ru/search/groups?q={0}%2F{1}"
timeZone = "Turkey"
alphabet = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ QWERTYUIOPLKJHGFDSAZXCVBNM"
catLink = "https://meow.senither.com/v1/random"
catLinkGet = "https://meow.senither.com/c/{0}"